[
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/recruitment-resourcer-fts-recruitment-JV_IC3313555_KO0,21_KE22,37.htm?jl=2834154561", "Job_Id": "2834154561", "Employment_Type": "", "Location": "Bournemouth", "Region": "", "Salary": "", "Posted_By": " FTS Recruitment Ltd", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-FTS-Construction-Recruitment-EI_IE1683868.11,39.htm", "Job_Title": "Recruitment Resourcer", "Country": "Bournemouth,", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"> FTS Construction Recruitment is a specialist recruitment agency that provides high-quality resourcing solutions to construction companies operating throughout the South of England. <br><br> With client requirements at an all-time high we are seeking talented and highly motivated individuals to join the successful team within our Bournemouth office. <br><br><strong>Basic Salaries of £16,500 to £24,000 + Uncapped Commission</strong><br><br> We currently have a need for Resourcers who will provide a source of quality applicants by nurturing existing candidate relationships, undertaking head hunting campaigns and managing the recruitment process from initial interview to placement. <br><br> In addition to sourcing talent for some of the world’s largest construction companies you will: <br><br> 1. <br> Choose your own basic salary and commission structure <br><br> 2. <br> Decide on the best call times rather than having them set for you <br><br> 3. <br> Work in a comfortable office facility complete with roof garden, bar and BBQ <br><br> 4. <br> Work within a lively, fun and sociable team environment where everyone pulls together <br><br> 5. <br> Have your achievements recognised with rewards and incentives <br><br> 6. <br> Know exactly how your career will progress and receive support to help get you there <br><br> Whilst recruitment experience is not essential as full training will be provided, you will need to be an outgoing, self-motivated winner who has an engaging personality, a professional telephone manner and a passion for achieving success within the recruitment industry. <br><br> If you like the sound of this opportunity then please submit your application or call <strong>Morgan Scott on 01202 201225</strong> for more information.</div>"], "Date_Posted": "2018-07-02", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:27:07 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/account-executive-paddle-com-JV_IC2671300_KO0,17_KE18,28.htm?jl=2828492535", "Job_Id": "2828492535", "Employment_Type": "", "Location": "London", "Region": "", "Salary": "", "Posted_By": " Paddle.com", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-Paddle-EI_IE988509.11,17.htm", "Job_Title": "Account Executive", "Country": "London,", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"><strong>About Paddle</strong><br><br> Our mission is to help software companies succeed - enabling them to focus on creating products the world loves. Hundreds of companies rely on our e-commerce platform to sell their software products globally, as well as our powerful analytics and marketing tools to understand and grow their businesses. <br><br> Our vision is to become the platform that all software companies use to run and grow their business. We aim to replace a fragmented ecosystem of specialised tools with a unified platform that removes the complex burden that comes with running a software business, whilst also providing unparalleled insight to help them grow faster. <br><br> We’re early in our journey but making great progress: Deloitte Fast 50 named us the fastest growing software company in the UK (we’ve tripled revenue every year since our launch in 2012), and we’ve raised over $17m in funding from incredible investors such as Notion, BGF and Kindred. <br><br><strong>About the role</strong><br><br> As an Account Executive in our sales team, you’ll be essential to helping us achieve our ambitious growth plans. This is an exciting time for you to join: with the size and breadth of customers we’re working with growing exponentially. <br><br> Working within our sales team your core task will be to take on qualified leads from our Sales Development Reps (SDRs), and convert them into Paddle customers. <br><br><strong>What you'll do</strong><ul><li>Improving upon existing sales methods based on data-driven tests.</li><li>Implementing new strategies to effectively showcase Paddle and win new customers.</li><li>Identifying flaws in both Paddle's product and our competitors' during the sales process. Helping to inform our sales techniques and product roadmap.</li></ul><strong>Your experience</strong><ul><li>Experience in a previous sales / account management role</li><li>Experience liaising with clients over phone &amp; email</li><li>Highly competent on both macOS &amp; Windows platforms.</li></ul><strong>Useful skills</strong><ul><li>Prior experience at a growth stage Internet/software company.</li><li>Experience selling to technical persons, (CTO, Head of Product, (Technical) Founders).</li><li>Familiarity with eCommerce providers such as Stripe, Braintree, PayPal, Cleverbridge.</li></ul><strong>What’s in it for you</strong><br><br> We are a diverse team of 60 people (quickly on our way to 100+) based near London Bridge. We care deeply about enabling a great culture as we scale, which is inclusive no matter your background, rewarding for you and enables high performance, which is why we offer these (constantly evolving) benefits: <ul><li>Fair compensation: you’ll get a competitive salary, share options to succeed if we do, and pension contributions matched up to 3%.</li><li>Empowered to succeed: transparent culture where you can speak up and have an impact, work the way you prefer whether it’s the latest Macbook, a standing desk or flexible hours, and 33 days annual leave (including bank holidays).</li><li>Meaningful work: highly collaborative work culture with a tangible impact of your work on our success and that of our customers.</li><li>Enjoyable team work: very friendly and respectful culture, lots of free food from a welcome team meal to Tuesday catered lunches to Friday drinks and your pick of social activities, whether you want to join our football team, in-office yoga lessons or board game nights.</li><li>Learning &amp; growing: constant exposure to new challenges as we’re one of the fastest growing companies in the UK, dedicated on-boarding as well as regular internal and external training we’ll pay for.</li></ul><em>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, colour, national origin, gender, sexual orientation, age, marital status or disability status.</em></div>"], "Date_Posted": "2018-06-27", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:27:11 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/gis-technician-sandbach-sibelco-JV_KO0,23_KE24,31.htm?jl=2842663239", "Job_Id": "2842663239", "Employment_Type": "", "Location": "United", "Region": "", "Salary": "", "Posted_By": " Sibelco", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-Sibelco-Group-EI_IE614521.11,24.htm", "Job_Title": "GIS Technician - Sandbach", "Country": "United", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"> Sibelco mines and manufactures a wide range of mineral products for both local and international markets. Founded in 1872, Sibelco began in Europe and has grown into one of the largest industrial minerals companies in the world - privately owned and multinational, our vision is to be the best Global Material Solutions Company. We are market driven, operationally excellent and offer a compelling culture. <br><strong>Role Overview:</strong><br><br> We currently have a vacancy for a GIS / CAD Technician to join our Sustainability group based at our UK HQ in Sandbach. <br><br> Our technical role will report to the Sustainability Manager on activities including asset and land management, production of maps and plans, maintenance of GIS database of UK land and property assets and maintenance of paper land and property terrier for UK sites. <br><br><strong>Responsibilities:</strong><li>Support the local Sustainability Manager with monitoring and coordinating the land and asset management on local level.</li><li>Actively work with the European land and asset management platform to keep all information updated</li><li>Set up and maintenance of land and asset Terrier database</li><li>Implement policies, guidelines and strategies from Corporate Sustainability</li><li>Update the GIS system which will be provided by Corporate Sustainability and maintain the UK land and asset GIS database</li><li>Assist with coordinating and managing local processes on external communication and representation concerning the responsibilities on sustainability.</li><strong>Key Attributes Required:</strong><li>Related qualification or equivalent land surveying experience</li><li>Demonstrated experience using GIS systems and good technical skills of CAD systems</li><li>Experience of working in a multinational business would be desirable</li><li>Enjoy working in a progressive, change orientated environment</li><li>An ability to work both within a team and independently</li> Please submit your application by clicking apply to be formally considered for our role. If you would like to discuss this position before applying please enquire by contacting Sally Cantello at sally.cantello@sibelco.com. Please note we will not be engaging with recruitment agencies for this role. <br><br> Closing date for applications is Tuesday 24th July. <br><br> Sibelco recognises the strength of our diverse global workforce and value difference and inclusion for all. Our rich mix of people bring an exciting exchange of ideas and knowledge to keep us moving forward and innovating new solutions. We seek talent of all backgrounds and abilities and continue to develop our leaders and our culture to help all employees to grow and reach their full potential.</div>"], "Date_Posted": "2018-07-10", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:27:17 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/information-security-consultant-lineon-uk-JV_IC2671300_KO0,31_KE32,41.htm?jl=2841749777", "Job_Id": "2841749777", "Employment_Type": "", "Location": "London", "Region": "", "Salary": "", "Posted_By": " LineOn UK Ltd", "Job_Poster_Url": "https://glassdoor.co.uk#", "Job_Title": "Information Security Consultant", "Country": "London,", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"> LineOn is an Information Security Pureplayer which delivers expert services to clients across Europe. We specialise in Consulting and Technical services spanning sectors including Government, Aerospace, Manufacturing, Media and Finance. With 40% growth in 2017 the LineOn Group is looking for Information and Cyber Security talent to help grow the UK side of the business. <br><br> Do you have 5+ years relevant experience in Information or Cyber Security? Do you have a strong work ethic and desire for continued learning and development? Are you willing to be an ambassador for the business and to help us continue our growth? Do you want to be a part of the future of a company with incredible potential? <br><br> Successful candidates must have the following: <ul><li>Been engaged in a number of security positions with relevant previous experience in a technical or consulting role.</li><li>Experience of risk management and the implementation/use of appropriate tools.</li><li>Broad knowledge of security requirements and controls covering procedures, technical solutions and physical controls.</li><li>Excellent presentation and communication abilities to present security principles to technical and non-technical clients.</li><li>Confidence to present to key business influencers such as a board,</li><li>Flexibility for travel across the South East,</li><li>Must be willing to undergo, and able to pass, a background check.</li></ul> Responsibilities will include interfacing with the client to: <ul><li>Achieve a rapid understanding of a client’s current risk and governance structure,</li></ul><ul><li>Interface the client’s risks and controls in to our own tools,</li></ul><ul><li>Organise and run workshops on client premises to develop scenarios,</li></ul><ul><li>Interpret output, develop findings and present these to the client, often at board level.</li></ul> Helping to develop the business by: <ul><li>Looking for and securing new clients and generating business leads,</li></ul><ul><li>Assist in finding new talent.</li></ul> Other general activities could include working with clients to: <ul><li>Provide information security subject matter expertise,</li></ul><ul><li>Ensure that the commensurate level of information security controls and procedures are designed into new solutions and processes,</li></ul><ul><li>Provide support and solutions to the business to embed security controls into new solutions and processes,</li></ul><ul><li>Plus any other general activities related to the job function.</li></ul> The following attributes would be highly desirable: <ul><li>Experience with Airline, Financial and/or manufacturing Industries,</li></ul><ul><li>Relevant qualifications such as CISSP, CISM, CCP SIRA, etc</li></ul><ul><li>Experience in PCI-DSS, ISO 27001/2/5 or any other compliance standards,</li></ul><ul><li>Knowledge or background in business.</li></ul><ul><li>Flexibility over travel throughout the UK. Flexibility to work abroad would be desirable but not essential.</li><li>Knowledge or experience of IT Security technologies (Firewalls, proxies, DLP, VA/pentest tools)</li></ul> We expect the successful candidate to: <ul><li>Get involved with building the business, generating client leads, identifying suitable candidates and being an ambassador for LineOn UK.</li><li>Deliver a value-added service to our clients.</li><li>Be a natural problem-solver and work proactively to address the needs of the client.</li></ul> We offer: <ul><li>Competitive salary, performance-related bonus and benefits package</li><li>Varied and challenging client base</li><li>Pathway to becoming a Partner in the business and share in the success of the business</li></ul> LineOn UK is an equal opportunities employer and we take our commitment to inclusion very seriously. Besides, if we only recruited from one group of people then life would be very dull. What matters to LineOn is your ability to get the job done. However, we regret that we cannot accept applications from those without the right to work in the UK. It is equally regrettable that we are unable to sponsor anybody through the visa process. We know that there are some very talented people across the world and if we could we would love to take some of them on board, however any applications from people without the right to work in the UK will be automatically rejected. <br><br> Resumés and covering letters can be sent to careers@lineon.co.uk.</div>"], "Date_Posted": "2018-07-09", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:27:21 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/marketing-manager-maternity-cover-thwaites-JV_IC2662358_KO0,33_KE34,42.htm?jl=2728795161", "Job_Id": "2728795161", "Employment_Type": "", "Location": "Blackburn", "Region": "", "Salary": "", "Posted_By": " Thwaites", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-Thwaites-EI_IE804799.11,19.htm", "Job_Title": "Marketing Manager - Maternity Cover", "Country": "Blackburn,", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"><strong>We have an exciting opportunity to join us as a Marketing Manager on a maternity cover contract!</strong><br><br> Daniel Thwaites is a leader in the hospitality industry with 8 Hotels, 10 Inns, and 250 pubs. <br><br> Changing from a large brewery to focusing on hospitality and leisure, we are looking for an experienced Marketing Manager for Maternity Cover to be able to work within the different sectors of the business, creating marketing material which is suitable for them. <br><br> It’s an exciting time for us, with significant investment taking place across the company. If you’re an experienced and creative marketing manager that thrives in a fast paced environment with customer service at its heart, come and join our in-house team. <br><br><strong>About the Role:</strong><br><br> We’re looking for someone who is multi-skilled to help share our story through cross-channel marketing activity. You’ll work within a small, but perfectly formed, local marketing team, whilst collaborating and co-ordinating with the wider company. <br><br> It’s a role that’s at the heart of developing and implementing creative campaigns, so you’ll get a chance to use and develop your skills every day and see your hard work come to life in pubs, inns and hotels around the country. <br><br><strong>Key responsibilities include:</strong><br><br> •Developing marketing plans for different divisions within the business •Managing creative marketing campaigns end-to-end <br><br> •Leading the in-house design team to produce inspiring artwork to drive our sales <br><br> •Spending budgets wisely, tracking returns and learning from successes <br><br><strong>We’re looking for:</strong><br><br> •An experienced marketing manager with a proven track record <br><br> •A minimum of 5 years’ marketing experience, ideally within a service/hospitality business <br><br> •Someone who is highly creative and an innovator <br><br> •A team player who can work across functions, consulting and influencing to achieve results <br><br><strong>Company Benefits :</strong><br><br> •We have excellent benefits available including company pension; company discount scheme on food, drink, accommodation, spa and spa treatments; childcare voucher scheme; occupational sickness benefit; healthshield; free parking; 33 days annual leave; long service awards; enhanced maternity pay plus much more. <br><br><strong>What are you Thwaiting for? Apply now!</strong></div>"], "Date_Posted": "2018-07-03", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:27:28 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/head-of-information-governance-the-institute-of-cancer-research-JV_IC2671300_KO0,30_KE31,63.htm?jl=2720863909", "Job_Id": "2720863909", "Employment_Type": "", "Location": "London", "Region": "", "Salary": "", "Posted_By": " The Institute of Cancer Research", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-The-Institute-of-Cancer-Research-EI_IE226001.11,43.htm", "Job_Title": "Head of Information Governance", "Country": "London,", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"> We are currently seeking an experienced <strong>Head of Information Governance and Data Protection Officer</strong> to set the agenda for the ICR with respect to Information Governance across the organisation.The successful candidate will provide guidance, support, oversight and challenge to the ICR on all aspects of Information Governance. The role will also be responsible for identifying and reporting areas of risk and information control weakness and to support the business in the implementation of pragmatic mitigation plans to ensure the ICR meets its legal and statutory obligations for information governance. <br><br> The post holder will report directly to the Director of Academic Services and work in close partnership with our research support services. <br><br> Considerable experience of working in a senior role in Information Governance is essential together with an advanced understanding of the information needs and priorities of a research-focused higher education institution. You will also be expected to demonstrate a good understanding of current Information Security Management practices and frameworks, including ISO: 27001:2013 and the NHS Information Governance Toolkit. <br><br> Salary for this post is within the range from £56,387 to £66,338 per annum inclusive based on relevance of skills and experience <br><br> The role will be based across our sites in Chelsea and Sutton, London. <br><br> We consider all applications on merit and have a strong commitment to enhancing the diversity of our staff. <br><br> Closing date: 19/04/2018 at 16:00</div>"], "Date_Posted": "2018-06-26", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:27:35 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/general-labourer-rullion-JV_IC3380454_KO0,16_KE17,24.htm?jl=2842764195", "Job_Id": "2842764195", "Employment_Type": "", "Location": "Oxford", "Region": "", "Salary": "", "Posted_By": " Rullion", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-Rullion-EI_IE779643.11,18.htm", "Job_Title": "General Labourer", "Country": "Oxford,", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"><p></p><p>GENERAL LABOURERS/OPERATIVES</p><p></p><p>Location: WEST LONDON</p><p></p><p>Pay Rate: £9.50-£11.50 per Hour</p><p></p><p></p><p>GENERAL LABOURERS. Looking for work over the summer? We need General and Skilled Labourers for Labouring jobs across London. Immediate Start,</p><p></p><p>Current job locations are below, please contact Rullion for more information.</p><p></p><p>Current Locations:</p><ul><li>Acton</li><li>Brentford</li><li>Fulham</li></ul><p></p><p>Labourer Duties may include:</p><ul><li>Keeping the site tidy</li><li>Removing waste materials &amp; filling skips</li><li>Unloading deliveries</li><li>Any other reasonable site duties</li></ul><p></p><p>You will need:</p><p>Valid CSCS card</p><p>Availability over the next 12 weeks</p><p></p><p>It would be useful to have:</p><p>UKATA Asbestos Awareness (training can be provided)</p><p></p><p></p><p>To apply please contact Rullion as soon as possible on 02032011266</p><p></p><p>Since 1978, Rullion has been securing exceptional candidates for a range of clients; from large well-known brands, to SMEs and start ups. As a family-owned business, Rullion’s approach is credible and honest, focused on building long-lasting relationships with both clients and candidates. Rullion is a forward-thinking recruitment company that specialises in providing a wide range of talent consultancy services to a diverse client base; from small start-ups to large household names.</p></div>"], "Date_Posted": "2018-07-10", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:27:38 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/finance-director-rgduncan-senior-finance-recruitment-JV_IC2671300_KO0,16_KE17,52.htm?jl=2837559012", "Job_Id": "2837559012", "Employment_Type": "", "Location": "London", "Region": "", "Salary": "", "Posted_By": " RGDuncan Senior Finance Recruitment", "Job_Poster_Url": "https://glassdoor.co.uk#", "Job_Title": "Finance Director", "Country": "London,", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"> Our client, a boutique corporate finance specialist seeks a hands-on Finance Director to lead this young, yet established firm through its next stage of growth. Ideally you will be a self-starter who can lead the finance function and can manage complex projects and change. <br><br><strong>Company Background</strong><br><br> The Company has been established for over 4 years and grown quickly with over 25 employees based in its west end offices in London. <br><br> Primary activities are providing bridging and development finance for the property sector with over £250m lent since inception <br><br> The company has recently raised 50m debt financing and boasts over £100m of debt financing facilities available in its short history. <br><br><strong>Background and experience</strong><br><br> The finance director Qualified ACA/CIMA/ACCA with min 10 years PQE and have experience in Financial Services. Other skills include: <br><br> Specialist lending experience <br> Structured finance experience <br> Experience in regulatory and retail deposits will be beneficial <br> Senior management experience <br> Regulatory <br><br><strong>To apply</strong><br><br> Send your CV along with a brief covering letter outlining your interest and experience.</div>"], "Date_Posted": "2018-07-04", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:27:44 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/service-management-consultant-topdesk-JV_KO0,29_KE30,37.htm?jl=2821124901", "Job_Id": "2821124901", "Employment_Type": "", "Location": "Greater", "Region": "", "Salary": "", "Posted_By": " TOPdesk", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-TOPdesk-EI_IE593680.11,18.htm", "Job_Title": "Service Management Consultant", "Country": "Greater", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"> for an inquisitive, customer oriented and problem solving graduate<br><br>Your job: Service Management Consultant<br><br>As a consultant, you will be visiting customers to improve processes and implement our software. You collaborate with managers and executives during every stage of the implementation process. TOPdesk consultants work side-by-side with the customer and use their expertise to optimize customer processes and set up the software to perfectly meet their needs. <br><br> If you have the confidence to lead projects, enjoy working with a wide variety of people and are interested in IT, TOPdesk can offer you the ideal opportunity to develop your talent at a young and dynamic software company.<br><br>Your profile <ul><li>A graduate with a 1st or 2:1 level university degree – all disciplines are welcome</li><li>Strong affinity for IT</li><li>Creative and analytical thinker</li><li>Excellent interpersonal and communication skills</li><li>Pragmatic and inquisitive with a proactive approach to learning</li><li>Enjoys working in an international and multicultural environment</li><li>Can work well individually and in a team</li><li>Enjoys frequent travel to customers</li></ul> What can you expect from us? <ul><li>40 hours of work per week, with the flexibility and freedom to manage your workload without stringent working hours</li><li>Early customer contact across a spectrum of industries and locations</li><li>Extensive in-house training and unlimited career support</li><li>The chance to become an expert in ITSM, ISO 20000, Prince2, ITIL and TQM</li><li>An inspiring work environment: TOPdesk is the international market leader in service management software</li></ul> Interested?<br><br>Please send us your CV and cover letter to vacancies-uk@topdesk.com.<br><br>Apply now<br><div></div><br></div>"], "Date_Posted": "2018-06-20", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:27:51 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/labourers-rullion-JV_IC2671300_KO0,9_KE10,17.htm?jl=2842714239", "Job_Id": "2842714239", "Employment_Type": "", "Location": "London", "Region": "", "Salary": "", "Posted_By": " Rullion", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-Rullion-EI_IE779643.11,18.htm", "Job_Title": "labourers", "Country": "London,", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"> LABOURERS - LONDON <br><br> Pay Rate - £9.50-£12 per Hour <br><br> GENERAL LABOURERS. Looking for work over the summer? We need General and Skilled Labourers for Labouring jobs across London. Immediate Start, <br><br> Current job locations are below, please contact Rullion for more information. <br><br> Current Locations: <br><br> - <br> Central London/Zone 1 ; Holborn , Moorgate , Victoria <br><br> - <br> East London ; Stratford &amp; Romford <br><br> - <br> West London ; Acton , Brentford , Fulham <br><br> - <br> North London ; Hampstead, Harringay, Southgate <br><br> - <br> South London ; Brixton , Wimbledon , Redhill <br><br> Labourer Duties may include: <br><br> - <br> Keeping the site tidy <br><br> - <br> Removing waste materials &amp; filling skips <br><br> - <br> Unloading deliveries <br><br> - <br> Any other reasonable site duties <br><br> You will need: <br><br> Valid CSCS card <br><br> Availability over the next 12 weeks <br><br> It would be useful to have: <br><br> UKATA Asbestos Awareness (training can be provided) <br><br> To apply please contact Rullion as soon as possible on 02032011266</div>"], "Date_Posted": "2018-07-10", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:28:06 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/experienced-deep-cleaning-love-filthy-cleaning-JV_IC3414388_KO0,25_KE26,46.htm?jl=2834809589", "Job_Id": "2834809589", "Employment_Type": "", "Location": "Worcester", "Region": "", "Salary": "", "Posted_By": " Love Filthy Cleaning", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-Love-Filthy-Cleaning-EI_IE2162285.11,31.htm", "Job_Title": "EXPERIENCED DEEP CLEANING", "Country": "Worcester", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"> EXPERIENCED DEEP CLEANER NEEDED WITH FULL UK DRIVING LICENCE <br><br> Love Filthy Cleaning is a high standard, reputable company that is growing rapidly and looking for hardworking, experienced deep cleaners. We are based in Worcester Park and we work across the KT Area. There is a fantastic opportunity to work hard and grow within the business within a year. From the role of a deep cleaner, you can be looking to grow into a Team Leader or an Area Manager. We as a company care about our employees very much and want them to do well for themselves. As we only hire in-house we will always do our best to accommodate your interests and allow you to progress to where you want to be within the company. <br><br> In your role, you would be required to do the following: <ul><li>Deep clean all types of houses prior to and post to moving out, after builders clean, commercial cleaning, blitz cleaning alongside a removals company, carpet cleaning and window cleaning.</li><li>Work well within a team to make sure the job is completed to the impressively high standard beyond what our customers expect.</li><li>Maintain good working relationships with colleagues and customers.</li><li>Use chemicals correctly and safely.</li><li>Have excellent time and communication skills.</li><li>Deal with any issues efficiently and in a professional manner.</li><li>Ensure all health and safety procedures are being followed at all times.</li><li>Complete a 3-month probation.</li></ul> The successful candidate will: <ul><li>Have at least 1 years of Deep Cleaning experience.</li><li>Be physically and mentally fit to carry out the work provided.</li><li>Have a full UK Driving Licence.</li><li>Have your own transport (Ideal but not essential).</li><li>Have the correct footwear as this is not supplied.</li><li>Live within the KT Area.</li></ul> This role is 35 hours a week, working hours vary due to the nature of the business and being able to accommodate our customer's needs. Our working hours are 7 am to 9 pm, Monday to Sunday. On average you will work 7-8 hours a day, from 9-10am to 4-5pm, and a hours lunch when doing 8 hours. Some days you may leave at 3 pm, some days you may not finish the job until 9 pm. In these cases, we will do our best to re-arrange the hours with the customer so that you can finish the job another day and leave at a reasonable time. You will never do more than your 35 hours a week unless you request overtime, or if you are happy to do overtime when needed. <br><br> Please keep in mind this is not domestic cleaning and most jobs take on average 8 hours as detail is essential. <br><br> Company van and tablet provided when promoted to Team Leader. <br><br> Choice of Self-Employment or PAYE is accepted after 3-month probation. <br><br> Some training and PPE will be provided. <br><br> 28 days paid holiday. <br><br> Wage: £9 per hour. <br><br> Job Type- Full Time <br><br> The successful candidates will need to provide the following information before starting work: <ul><li>Some form of ID (E.g. Passport or Driving Licence).</li><li>National Insurance Number.</li><li>CSCS Card if required.</li><li>5 years of work history.</li><li>1 years checkable references.</li></ul> If you would like to discuss this role further please contact Charlotte Bradley on 0208 330 4837.</div>"], "Date_Posted": "2018-07-02", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:28:12 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/sales-development-representative-opogo-JV_IC2671300_KO0,32_KE33,38.htm?jl=2721817922", "Job_Id": "2721817922", "Employment_Type": "", "Location": "London", "Region": "", "Salary": "", "Posted_By": " Opogo", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-Opogo-EI_IE2045439.11,16.htm", "Job_Title": "Sales Development Representative", "Country": "London,", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"><em>Would you like to work for a well-funded start up with predictable revenues and an exciting business model launching a new app in the education market in 2018?</em><br><br><em>Would you like to work with a proven and credible management team?</em><br><br><em>Do you believe Education technology can change the world for the better?</em><br><br><strong>We are hiring 6 SDRs as part of building a world class sales academy where you can develop into an account executive, consultant or community manager once you complete the 12-month programme.</strong><br><br> We will be expanding internationally so there are future opportunities for travel and relocation. <br><br> If you are hungry and keen to be part of something truly exciting…………… <br><br><strong>This might be the opportunity for you:</strong><br><br> You will be responsible generating leads for the account executives and consultants <br><br> You will be contributing to the success of the account executives and consultants <br><br> You will be speaking to every new community member who joins our network <br><br> You will have access to our database of members to call, nurture and to convert to active <br><br> You will be part of a team of 6 will opportunities to grow and develop <br><br><strong>Key Benefits:</strong><ul><li>Great OTE</li><li>Commission based role</li><li>Other incentives including experience away days, trips abroad and gift rewards</li><li>30 Days Holiday</li><li>You will have day to day access to Founding Team</li><li>Collaboration opportunities with the marketing team</li><li>Awesome culture and social calendar when it works for you</li><li>Opportunity to eat and hang out in cool places</li><li>12 month learning and development programme</li><li>We are part of the Sales Confidence Sales Accelerator which will give you access ongoing external training by the best sales leaders in London</li></ul><strong>What we expect:</strong><br><br> You're ambitious, driven, results orientated and can work independently <br><br> You have dreams, ambitions and goals and believe we can help you achieve them <br><br> You're curious and naturally likeable <br><br> You're fun to be around <br><br> You have a great phone voice <br><br><strong>Salary</strong><br><br> Up to £25k base salary and £30k OTE</div>"], "Date_Posted": "2018-06-27", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:28:25 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/front-of-house-manager-grouse-and-ale-JV_IC2681375_KO0,22_KE23,37.htm?jl=2837634564", "Job_Id": "2837634564", "Employment_Type": "", "Location": "High", "Region": "", "Salary": "", "Posted_By": " Grouse and Ale", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-Grouse-and-Ale-EI_IE2164615.11,25.htm", "Job_Title": "Front of House Manager", "Country": "High", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"><strong>The Ideal Candidate</strong><br><br> You will be the face of our business, interacting with customers and ensuring their visit is one to remember for all the right reasons and maintaining excellent customer relations and the generation of regular positive reviews. Additionally, you will oversee the floor and bar staff ensuring that they are working to the best of their ability. You will need to be genuinely passionate about customer service and hospitality and have the ability to ensure high standards across the business. All of our Front of House carry out all aspects of service, including greeting customers, explaining the menu and our cooking process, answering any queries they may have, taking the orders, inputting orders onto the till, liaising with Back of House staff and serving food and drink. Other duties include preparing the bill and taking payment, as well as cleaning and setting-up tables. You will strive to exceed our customers’ expectations and deliver a truly exceptional experience. Additionally, you will want to progress within the company and help new recruits to deliver excellence. <br><br><strong>Abilities</strong><br><br> You must: <br><br> Have experience of working in a busy pub/restaurant environment both floor and bar <br><br> Be able to manage and motivate staff <br><br> Have ability to manage table allocations and larger groups <br><br> Be able to deal with customer issues, professionally and to mutual satisfaction <br><br> Communicate fluently in English and have the necessary work permit <br><br> Be computer literate <br><br> Ideally you should: <br><br> Have a personal licence <br><br> Have your own transport <br><br> Have cellar management training <br><br> Be familiar with stock control and stock taking <br><br><strong>Key Responsibilities</strong><br><br> Oversee floor and bar staff and assist with training <br><br> Ensure all food and drinks are correctly and promptly delivered to the customer <br><br> Ensure the best customer service and hospitality is provided and complaints are dealt with effectively <br><br> Manage the opening and closing of the restaurant and bar as required <br><br> Ensure that the business is operational prepared and everything is functioning correctly <br><br> Manage rotas and staff availability <br><br> Ability to change barrels and gas, handle casks and clean lines and general cellar management <br><br> Adhere to company policies and procedures and licensing laws <br> Be involved with and contribute to at all team meetings <br> Carry out instructions as given by management team <br><br> Assist with stock control and stock taking <br><br><strong>About Us</strong><br><br> We have a proven track record in running pub/restaurants to the highest standards having run the very popular Grouse &amp; Ale in Lane End for over 11 years and now The Yew Tree Frieth. Renowned for our excellent food as winners of South East Gastro Pub of the Year and Trip Advisor Certificates of Excellence 2013-2017 as well as 100% from Cask Marque for last 7consecutive years, we provide a friendly and relaxed dining environment with busy bar. Both pub/restaurants are located 4 miles from Marlow and 7miles from Henley and High Wycombe. <br><br><strong>The Benefits and Rewards</strong><br><br> We offer a reward and benefits package designed to fully reflect your performance and endeavour. For any member of our Front of House Team who can add to our growing reputation for serving top quality food and drink, then this is just a taste of what you can expect: <br><br> · <br> A competitive salary <br><br> · <br> 28 days’ holiday (pro rata for part-time) <br><br> · <br> Bonus scheme <br><br> · <br> The chance to develop your knowledge and skills, in a busy and fun environment. <br><br> · <br> Range of training programmes and courses relating to food, drink and management functions <br><br> · <br> The chance to progress your career as the company grows <br><br> ·</div>"], "Date_Posted": "2018-07-04", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:28:28 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/in-house-paralegal-topdesk-JV_IC2671300_KO0,18_KE19,26.htm?jl=2830468114", "Job_Id": "2830468114", "Employment_Type": "", "Location": "London", "Region": "", "Salary": "", "Posted_By": " TOPdesk", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-TOPdesk-EI_IE593680.11,18.htm", "Job_Title": "In-House Paralegal", "Country": "London,", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"> In-House Paralegal<br><br>TOPdesk develops and markets an award-winning Service Management tool that is used by over 4,000 organisations worldwide. In this role, you are surrounded by enthusiastic colleagues and are part of a winning IT service management team. <br><br> This is an ideal opportunity intended for entrants into the legal profession and provides candidates with a unique opportunity to apply their legal knowledge in a commercial context. Practical legal experience is therefore welcomed but not necessary.<br><br>Your job: In-House Paralegal<br><br>As our in-house paralegal, your key responsibilities will include the legal review of contractual documents. This includes assessing the legal and commercial risks of third party sale and licensing terms, as well as amending terms to reflect concerns raised and diminish or decrease commercial risk. In addition, you will be drafting legal documents and policy statements by drafting updates, additions and changes to existing terms and conditions. You will create new legal terms and agreements where required and write legal policy statements in easily comprehensible terms. As a paralegal, you will also conduct legal research as necessary to accurately assess legal risks of terms and conditions as well as research to aid in statutory compliancy assessments. In terms of commercial and legal negotiations, you will engage in both oral and written legal negotiation with third party legal professionals as part of the legal review. Furthermore, you shall collaborate and communicate legal matters with lay persons. You will work alongside account managers to support completion of contractual requirements for existing and potential clients.<br><br>Our ideal candidate <ul><li>A final year law student or graduate with a 1st or 2:1 university degree or completed their GDL with commendation or higher</li><li>Has good knowledge of contract and tort law concepts</li><li>Able to conduct sound legal analysis of contracts and applicable law</li><li>Holds commercial awareness and has the ability to apply legal concepts in a commercial context</li><li>Has practical experience of legal research (e.g. previous paralegal experience, mooting, legal debate competitions)</li><li>Able to articulate issues effectively and get to the heart of complex issues both orally and in writing</li><li>Possesses excellent written and excellent organisational skills as well as attention to detail</li><li>Good at working under pressure in the face of competing demands and external deadlines</li><li>Capable to work with minimal supervision</li><li>Team player</li><li>Interested in working in a commercial environment</li><li>Has knowledge of data protection legislation and IT (nice to have, but not required)</li></ul> What can you expect from us? <ul><li>The opportunity to work 3 days a week at a central London location</li><li>A starting salary of £26,000 paid on a pro rata basis (determined on the applicant’s experience)</li><li>26 days of holiday pro rata, a great pension plan, and private health insurance options</li><li>Team outings, foosball and Fridays we stick to the tradition of a ‘borrel’ that entails snacks and drinks</li><li>Training at our HQ in The Netherlands</li><li>An exciting, supportive, international and multicultural environment</li></ul> Apply now<br><div></div><br></div>"], "Date_Posted": "2018-06-29", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:28:35 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/collision-estimator-caliber-collision-centers-JV_KO0,19_KE20,45.htm?jl=2844089992", "Job_Id": "2844089992", "Employment_Type": "", "Location": "Essex", "Region": "", "Salary": "", "Posted_By": " Caliber Collision Centers", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-Caliber-Collision-Centers-EI_IE506884.11,36.htm", "Job_Title": "Collision Estimator", "Country": "Essex", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"> Caliber Collision is the largest, fastest-growing collision repair company in America. Right now, we're looking for highly talented, dedicated, and quality-focused teammates to help restore the rhythm of our customers' lives. <br><br> To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to ensure individuals with disabilities are able to perform the essential functions. <ul><li>Estimate all drive in appointments and complete review process with customer</li><li>Repair Orders: All files are opened with BAR (CA) and DRP compliance, including obtaining proper authorizations.</li><li>Provide post repair plan communication including all vehicle status updates</li><li>Prepare and complete proper paperwork for final customer packet prior to vehicle delivery (DRP, final invoice).</li><li>Perform other related duties as assigned to ensure an efficient and effective repair</li></ul></div>"], "Date_Posted": "2018-07-11", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:30:14 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/tech-lead-future-vp-engineering-papercup-ai-JV_IC2671300_KO0,31_KE32,43.htm?jl=2837426459", "Job_Id": "2837426459", "Employment_Type": "", "Location": "London", "Region": "", "Salary": "", "Posted_By": " Papercup.AI", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-Papercup-AI-EI_IE2012195.11,22.htm", "Job_Title": "Tech Lead (future VP Engineering)", "Country": "London,", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"><p><strong>We’re looking for a Tech Lead (future VP Engineering) to join the crew!</strong></p><p><strong>The role and what we think you’ll need to do it:</strong></p><p>In this role, you will evolve into the <strong>VP Engineering</strong> and be part of the core management team. You know you need to be <strong>personally invested</strong><b>in building the business</b> and moving the product forward.</p><p><b>As Tech Lead at Papercup, you will lead a team and take ownership of the entire engineering and development process (from customer profiling and wire framing to prototyping and product development), so you can build and ship awesome products to market. You will develop, coach and empower a small team to successfully deliver.</b></p><p><strong>You:</strong></p><ul><li>have several years’ <b>experience as a Tech Lead</b> or senior engineer.</li><li>have been responsible for <b>building and shipping several products to market.</b></li><li>understand the pains and pitfalls of building and shipping high quality products.</li><li>understand how to balance writing good code and building a great product.</li><li>have assembled and <b>developed a team of engineers.</b></li><li>have <b>organised and run sprints and led on retrospectives.</b></li><li>have coached and developed junior members of a team.</li><li>have <b>worked in a start-up</b> environment before and know how to get things done.</li><li>have excellent communication skills and can empathise with the team.</li><li>thrive in an uncertain, ambiguous environment.</li><li>are ready to own something new.</li></ul><p><strong>The technical skills we think you’ll need to be successful:</strong></p><ul><li>You will be an expert in either <strong>back-end</strong> (<strong>Python) or front-end (React.js)</strong> (and play with Vue.JS too), and have an indepth understanding of the full-stack</li><li>You will know your way around <strong>Docker and / or Kubernetes.</strong></li><li>You will have excellent communication skills, both written and spoken.</li><li>You will probably have some knowledge of other tech stacks <b>because you’re awesome.</b></li></ul><p><strong>So, you’re interested in the role, but who are we? How do you know if you’ll love working with us?</strong></p><p>Backed by Entrepreneur First and other leading VCs, Papercup is a <strong>machine learning start-up</strong><b>transforming the media industry.</b> Using a patentable approach to speech processing, <b>we're auto-translating the voice track so the world's videos</b> can be watched in any language. That's right, any language!</p><p>Our CEO co-founded Deloitte’s tech incubator and start-up investment arm, before joining Octopus Labs and co-launching a new wealth tech venture! Our CTO has Masters from Cambridge in speech processing &amp; machine learning and was the first employee at a computer vision start-up, where he built their deep learning and cloud architectures.</p><p><strong>We're upfront about our culture because we're looking for people that will love working with us:</strong></p><p>Our company is built on<strong> trust and ownership</strong>. We've created an environment where people can openly discuss and challenge how we approach things. <b>We</b><strong>encourage difference in opinion </strong>because we know everyone is trying to achieve the same mission - translating the world's videos. Yes, that's an enormous and ambitious mission - that's why we look for people who can take on real responsibility - whether that's owning chunks of product or managing a team.</p><p>We've invested time and energy to build <strong>a team that wakes up excited to learn</strong>, to develop and to build with us.</p><ul><li><strong>We</strong><strong>respect each other</strong>, we listen, give – and take - feedback.</li><li><strong>We</strong><strong>take ownership</strong> for our work, we’re personally invested because we believe in the mission.</li><li><strong>We constantly learn</strong> and push ourselves, we know <strong>we aren’t perfect</strong> so embrace being wrong.</li><li><strong>We take care</strong><b>of ourselves</b> and each other, we know when we need down time and we take it.</li></ul><p><strong>Still reading? Great! So, who are you? How do we know we will love working with you too?</strong></p><p><strong>You are in this for the long run.</strong> You understand that we are going after something enormous and world changing, so you are <strong>prepared to be personally invested</strong><b>in building this business with us</b> and are excited by our mission.</p><p>You are aware that there are so many different components to the problem we are solving, that you are prepared to<strong> be proactive and brave</strong> in taking on additional responsibilities. <strong>You want to own it.</strong></p><p><strong>You are:</strong></p><ul><li><strong>hungry</strong> for success <strong>but humble</strong> and self-aware.</li><li><strong>dynamic</strong><b>and bright</b>, and can wear numerous different hats</li><li><strong>tenacious</strong><b>and disciplined</b>, you want to find a way to make it work, not take the easy way out</li><li><strong>not afraid</strong><b>……to fail</b>, to roll your sleeves up and get stuck in and to get out of your comfort zone.</li></ul><p><strong>Apart from all this good stuff, what else is on offer at Papercup?</strong></p><ul><li><strong>Everyone gets equity</strong>. We want you to be as invested in us as we are in you.</li><li>And of course, we offer competitive salaries.</li><li><strong>We trust you</strong> to know when you need downtime so everyone has <strong>unlimited holiday</strong>.</li><li>We usually have weekly team drinks, monthly meals out and will be planning a yearly getaway.</li><li>Our office is a <strong>design style open space</strong><b>in</b><strong>Shoreditch</strong> with easy transport links.</li><li>We have <strong>free stuff </strong>(yes, it's really free): fruit, cereals, snacks, soft drinks and beer fridge.</li><li>We know <strong>coffee is life.</strong> You’ll be able to get a job as a barista if you get bored of being a Tech Lead once you master our real coffee machine too.</li><li>There’s a ping pong table, break out sofas, communal eating area and phone booths.</li></ul><b>Tell us why you should be the Tech Lead and future VP Engineering at Papercup and apply today!</b><br><br>If you have any issues with your application, you can contact our Head of Talent directly; karen@papercup.ai<br><br>Bring it on!</div>"], "Date_Posted": "2018-07-04", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:30:21 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/deputy-nursery-manager-at-tinies-tinies-uk-JV_IC2688773_KO0,32_KE33,42.htm?jl=2828399888", "Job_Id": "2828399888", "Employment_Type": "", "Location": "Northwood", "Region": "", "Salary": "", "Posted_By": " Tinies UK Ltd", "Job_Poster_Url": "https://glassdoor.co.uk#", "Job_Title": "Deputy Nursery Manager at Tinies", "Country": "Northwood,", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"><p><strong>Deputy Nursery Manager at Tinies Northwood</strong></p><p><br>Are you looking for a new challenge that combines childcare with management?</p><p>Do you enjoy getting involved in all aspects of Nursery life and relish solving problems?</p><p>Do you hold a level 3 childcare qualification or higher?</p><p>Are you looking for a full time role (40 hours per week)?</p><p>If so, Tinies Childcare has the perfect opportunity for you. As the operators of the Tinies Nursery (inside David Lloyd Northwood), we are looking for an enthusiastic and reliable candidate to join the team.</p><p><strong><br>What we need</strong></p><ul><li>We are looking for an experienced deputy manager with at least 2 years of experience.</li><li>A candidate who demonstrates strong knowledge of the Ofsted framework and EYFS.</li><li>A candidate who is familiar with and act to safeguarding and child protection regulations.</li><li>A candidate who can assist the Nursery Manager with the day-to-day management for all staff, as well as building parent partnerships etc. </li><li>A candidate who is able to assist with the responsibility of child safety and Health and Safety legislation.<br></li><li>A candidate who can assist the Nursery Manager in monitoring and controlling all costs within the nursery, including meeting occupancy objectives.</li><li>A candidate who can support the Nursery Manager with preparing the setting for OFSTED Inspections or any other Regulatory Body Inspection including any actions or recommendations.</li><li>A candidate who has knowledge of Equal Opportunities Experience.</li><li>A candidate who has excellent communication skills.</li><li>A candidate who has a good knowledge of IT including Word and Excel.</li></ul><p><strong><br>What we would like like to see</strong></p><ul><li>A candidate who is able to assist the Nursery Manager with staff training and development.</li></ul><ul><li>A candidate who is able to work as part of a team in a child centred environment where the children are cared for in a safe, loving and stimulating way ensuring their individual needs are met within the group setting.</li></ul><ul><li>A candidate who will ensure the safety, security and well-being of all children attending the setting, through indoor and outdoor supervision, meal preparation.</li></ul><ul><li>A candidate who can familiarise themselves with and act according to, Safeguarding guidelines as set down by the local safeguarding board or Social Services.</li></ul><ul><li>A candidate who is able to live our values and act as a brand ambassador.</li></ul><p><br>The Tinies Northwood Nursery is open 5 days a week and provides a quality first class childcare service for children. The Nursery is open to David Lloyd members as well as members of the public. The Nursery can cater for 71 children and has access to activities within the health club such as swimming and tennis. This nursey boasts a long list of extracurricular lessons including languages and music.<br><br>Employees’ of the Nursery also get to enjoy access to the Fitness facilities as well as all our internal perks and benefits.<br><br>Applicants will need to show they have the right to work in the United Kingdom and the successful candidate will be subject to a DBS check and referencing checks.</p><p>Due to the high volume of applications, we are only able to contact successful candidates.</p></div>"], "Date_Posted": "2018-06-27", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:30:28 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/full-stack-developer-papercup-ai-JV_IC2671300_KO0,20_KE21,32.htm?jl=2837417561", "Job_Id": "2837417561", "Employment_Type": "", "Location": "London", "Region": "", "Salary": "", "Posted_By": " Papercup.AI", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-Papercup-AI-EI_IE2012195.11,22.htm", "Job_Title": "Full Stack Developer", "Country": "London,", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"><p><strong>We’re looking for a Full Stack Developer to join the crew!</strong></p><p><strong>The role and what we think you’ll need to do it:</strong></p><p>In this role, you will evolve into a senior pillar of the engineering team, you will be the conduit between our customer facing product and our machine learning backend. You will know our product intimately and will always be thinking about new ways to improve it. You will be an expert full stack developer with great knowledge of back end development.</p><p><b>As a Full Stack Developer at Papercup, you will want to jump in to any part of the technology stack, so you can ensure everything is running perfectly and we are constantly improving.</b></p><p>You:</p><ul><li>have a few years’ experience as a full stack developer in a small team.</li><li>have been an integral part of <b>shipping a product to market</b> before.</li><li>understand how to balance writing good code and building a great product</li><li>have <b>worked in a start-up before</b> and know how to get things done.</li><li>contribute to the creation and development of new product ideas.</li><li>thrive in an uncertain, ambiguous environment</li><li>be ready to own something new.</li></ul><p><strong>The technical skills we think you’ll need to be successful:</strong></p><ul><li>You will be an <b>expert in Python</b></li><li>You will have an understanding of frontend technologies eg. <b>JavaScript, HTML5, and CSS3</b></li><li>You will have knowledge of <b>React.js</b> and know your way around Vue.JS too.</li><li>You will have <b>knowledge of cloud infrastructures</b> such as AWS, Azure and Google Cloud</li><li>You will have excellent communication skills, both written and spoken.</li></ul><p></p><p><strong>So, you’re interested in the role, but who are we? How do you know if you’ll love working with us?</strong></p><p>Backed by Entrepreneur First and other leading VCs, <b>Papercup is a machine learning start-up transforming the media industry.</b> Using a patentable approach to speech processing, <b>we're auto-translating the voice track on videos</b> so the world's videos can be watched in any language. That's right, any language!</p><p>Our CEO cofounded Deloitte’s tech incubator and start-up investment arm, before joining Octopus Labs and co-launching a new wealth tech venture! Our CTO has two Masters from Cambridge in speech processing &amp; machine learning and was the first employee at a computer vision start-up, where he built their deep learning and cloud architectures.</p><p><strong>We're upfront about our culture because we're looking for people that will love working with us:</strong></p><p>Our company is built on <b>trust and ownership</b>. We've created an environment where people can openly discuss and challenge how we approach things. <b>We encourage difference in opinion</b> because we know everyone is trying to achieve the same mission-translating the world's videos. </p><p>Yes, that's an enormous and ambitious mission that's why we look for people who can take on real responsibility whether that's owning chunks product or managing a team. </p><p>We've invested endless time and energy to build a team that wakes up excited to learn, to develop and to build with us.</p><ul><li><b>We respect each other,</b> we listen, give and take feedback.</li><li><b>We take ownership</b> for our work, we’re personally invested because we believe in the mission.</li><li><b>We constantly learn</b> and push ourselves, we know <b>we aren’t perfect</b> so embrace being wrong.</li><li><b>We take care of ourselves</b> and each other, we know when we need down time and we take it.</li></ul><p><strong>Still reading? Great! So, who are you? How do we know we will love working with you too?</strong></p><p>You are <b>in this for the long run</b>. You understand that we are going after something enormous and world changing, so you are prepared to be personally invested in building this business with us and are excited by our mission.</p><p>You are aware that there are so many different components to the problem we are solving, that you are prepared to <b>be proactive and brave</b> in taking on additional responsibilities. <b>You want to own it.</b></p><p>You are:</p><ul><li><b>hungry</b> for success <b>but humble</b> and self-aware.</li><li><b>dynamic and bright,</b> and can wear numerous different hats</li><li><b>tenacious and disciplined</b>, you want to find a way to make it work, not take the easy way out</li><li><b>not afraid……to fail</b>, to roll your sleeves up and get stuck in and to get out of your comfort zone.</li></ul><p><strong>Apart from all this good stuff, what else is on offer at Papercup?</strong></p><ul><li><b>Everyone gets equity.</b> We want you to be as invested in us as we are in you.</li><li>And of course, we offer competitive salaries.</li><li><b>We trust you</b> to know when you need downtime so everyone has <b>unlimited holiday.</b></li><li>Our office is a <b>design style open space in Shoreditch</b> with easy transport links.</li><li>We have <b>free stuff</b> (yes, it's really free): fruit, cereals, snacks, soft drinks and a beer fridge.</li><li>We know <b>coffee is life.</b> You’ll be able to get a job as a barista if you get bored of being a full stack developer once you master our real coffee machine too.</li><li>There’s a ping pong table, break out sofas, communal eating area and phone booths.</li></ul><b>Demonstrate why you are the perfect Full Stack Developer for Papercup and apply today!</b><br><br>If you have any issues with your application, you can contact our Head of Talent directly; karen@papercup.ai <br><br>Good luck! :-)</div>"], "Date_Posted": "2018-07-04", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:30:35 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/general-manager-strawberry-bars-JV_IC2670717_KO0,15_KE16,31.htm?jl=2837365550", "Job_Id": "2837365550", "Employment_Type": "", "Location": "Watford", "Region": "", "Salary": "", "Posted_By": " Strawberry Bars", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-Strawberry-Bars-EI_IE2164443.11,26.htm", "Job_Title": "General Manager", "Country": "Watford,", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"> A great opportunity exists for an experienced GM in a well established Gentlemens Club in the heart of Watford town centre. <br><br> The applicants role will be to oversee and manage the nightly operation and control every aspect of the business. The applicant must have experience in, and will be responsible for; <br><br> - Marketing &amp; promotions <br><br> - Financial control <br><br> - Business development <br><br> - Sales <br><br> - Leadership <br><br> Applicants must hold a personal license and have a minimum 3 years experience in the late night entertainment industry at GM level. Experience in Gentlemens Clubs preferred but not necessary. <br><br> The successful applicant will display flare and entrepeneurial skills with a keen eye for detail. Being able to develop strong links with clients is a must and the applicant must be able to demonstrate strong networking skills. Experience of high end sales will be advantageous for this position.</div>"], "Date_Posted": "2018-07-04", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:30:42 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/sales-executive-brighttalk-JV_IC2671300_KO0,15_KE16,26.htm?jl=2826951562", "Job_Id": "2826951562", "Employment_Type": "", "Location": "London", "Region": "", "Salary": "", "Posted_By": " BrightTALK", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-BrightTALK-EI_IE385646.11,21.htm", "Job_Title": "Sales Executive", "Country": "London,", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"><div><div>Our mission is to bring professionals and businesses together to learn and grow. Powered by Artificial Intelligence, BrightTALK is innovating how millions of professionals discover content and make better decisions in their jobs. Over 1000+ clients (including Amazon Web Services, Tableau, Micro Focus, F5, Dimension Data and Tibco) attribute more revenue to marketing campaigns with accurate targeting and engagement through BrightTALK’s content marketing platform.</div><div>At BrightTALK, we dream big. We inspire each other to pursue our dreams with urgency, confidence and tenacity. We are achieving record breaking success in all aspects of the business. We're seeking savvy Sales Executives with B2B marketing technology or media sales experience who understand strategies behind successful content marketing and demand generation initiatives to fuel our explosive growth.</div><div>You will be selling BrightTALK's SaaS content marketing platform, content services and high quality leads that are generated by connecting client content to millions of engaged professionals in business communities such as IT Security, Business Intelligence, Sales, Marketing and HR.</div><div>Our office is light and airy with a fluid work environment, loads of breakout spaces and pool and table tennis. Our kitchen is comfortable gathering place with a continual supply of fresh fruit, snacks and great coffee. We’ll provide you with a brand new Mac and flexible working that suits you.</div><br><div><div>Responsibilities:<br><ul><ul><li>Deliver consistent monthly sales bookings across BrightTALK’s products</li><li>Discover new opportunities and expand targeted accounts to meet and exceed quota targets</li><li>Solve customer marketing problems through solutions that deliver campaign success</li><li>Execute a solution sales process that adds value to customers through insights in order to win business and establish yourself as a trusted advisor</li><li>Become a strong advocate for customer success and mobilize resources to help customers succeed with their BrightTALK program investment</li><li>Work with Customer Success Managers and Product Leaders to generate demand and ensure customer success</li><li>Build strategic, long-term relationships with senior marketers and agencies to cement BrightTALK’s value proposition</li></ul></ul></div><br><div><div>Desired Skills and Experience:<br><ul><ul><li>Software / SaaS sales experience, including recent experience of selling to senior marketers</li><li>Experience developing and selling data-driven digital marketing programs to early to mid-stage adopters</li><li>Ability to work in a fast-paced, entrepreneurial, results-oriented culture where team members work together collaboratively</li><li>Excellent presentation, organization, communication (verbal and writing), and negotiation skills</li><li>Bachelor’s degree</li></ul></ul></div><br><div><div>Why we like working at BrightTALK:<br><ul><ul><li>Friendly, talented, collaborative and entrepreneurial teams.</li><li>Generous and comprehensive benefits.</li><li>Generous holiday policy with flexible schedule.</li><li>Beautiful London office close to Liverpool Street Station.</li><li>Regular company sponsored social events.</li><li>Training allowance and opportunities to innovate.</li><li>Team building and volunteering opportunities.</li><li>Stock options in our business.</li><li>We LOVE recognizing our people and award trips to our global offices for quarterly program winners.</li></ul></ul></div></div><div><div><strong>About BrightTALK</strong></div><br><div>BrightTALK brings professionals and businesses together to learn and grow. Over 7 million professionals engage with 75,000 free talks and 1,000 online summits to discover new technologies, learn from trusted experts and grow their careers. Thousands of businesses acquire and inspire their ideal audience with BrightTALK's AI-powered content and demand marketing platform.</div></div></div></div></div></div>"], "Date_Posted": "2018-06-26", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:30:48 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/inside-sales-representative-western-europe-french-speaker-tufin-JV_IC2671300_KO0,57_KE58,63.htm?jl=2742155945", "Job_Id": "2742155945", "Employment_Type": "", "Location": "London", "Region": "", "Salary": "", "Posted_By": " Tufin", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-Tufin-EI_IE544413.11,16.htm", "Job_Title": "Inside sales Representative, Western Europe, French Speaker", "Country": "London,", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"><strong>LOCATION: UK</strong><br><br> Responsibilities <ul><li>Identify and manage all clients and opportunities within the region as objectives</li><li>Contact all existing clients to confirm positions and responsibilities</li><li>Work with external sales and channel team where necessary</li><li>Work with marketing to drive attendance at events, webinars etc</li><li>Work with bought in databases and existing SFDC</li><li>Keep SFDC clean and up to date</li><li>Cold call, BANT qualify, technical overview, manage sales cycle and close deals</li><li>Understand channel strategy and work with channel managers to identify and close deals</li><li>Provide quotes, emails and back up as necessary into the target account list</li><li>Establish and develop ongoing professional relationships with key contacts</li><li>Ensure the renewals target is over achieved and identify up sell opportunities in that renewals base</li><li>Be the key contact and autonomous person for SME clients</li><li>Be able to own/drive a WebEx demo of the solution, and handle basic technical enquiries</li><li>Send appropriate client introduction emails and communications</li><li>Manage back office functions and liaise directly with Sales Ops etc</li><li>Carry out other duties that may be applicable to the role</li></ul> Requirements:<br><br>Measures <ul><li>Annual &amp; quarterly $ revenue sales target</li><li>Minimum 2 client WebEx demos per week</li><li>50 outgoing completed calls per week / 2 hours outbound per day</li></ul> Skills <ul><li>Native or business level proficiency in French &amp; English required</li><li>Strong work ethic</li><li>Good telephone manner</li><li>Good organizational skills</li><li>Ability to work as part of a team</li><li>Ability to identify sales opportunities</li><li>2 Years previous experience in similar sales role</li><li>Professional</li><li>Confident &amp; ambitious</li><li>Positive &amp; energetic</li></ul></div>"], "Date_Posted": "2018-06-17", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:30:57 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/enforcement-agent-bailiff-field-services-richardson-bailey-JV_IC2671300_KO0,40_KE41,58.htm?jl=2842629224", "Job_Id": "2842629224", "Employment_Type": "", "Location": "London", "Region": "", "Salary": "", "Posted_By": " Richardson Bailey", "Job_Poster_Url": "https://glassdoor.co.uk#", "Job_Title": "Enforcement Agent (Bailiff) – Field Services", "Country": "London,", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"> Fully paid whilst undergoing a City and Guild classroom and field-based training course (8-12 weeks). You will need to have NO Outstanding County Court Judgements’ a full UK driving licence and no past criminal record. <br><br><strong>The role:</strong><br><br> The work is predominantly focussed on engagement with customers, problem solving, collections and suits those with commitment and a desire to work hard in an environment that can offer a lot of flexibility in hours and can provide significant earnings potential for those that are focussed, committed, hardworking and have the right overall work ethic. There are also excellent opportunities for career progression in this sector. <br><br> Judicial services work is from large central government departments and local Government who contract out many of their activities to private companies. <br><br><strong>Enforcement Agent role:</strong><br><br> Enforcement agent roles are the front line of judicial services. <br><br> An enforcement agent is legally qualified (called certificated) to execute any order that a court (civil or criminal) passes onto them. They have significant powers to ‘Take Control of Goods’ and undertake other court related action. <br><br> In order to become a certificated agent, you will need to become skilled and pass a number of key industry related skills to NVQ or equivalent levels. <br><br> · Data protection and information security <br><br> · Vulnerability <br><br> · Legal aspects of relevant legal acts (Tribunal Courts and Enforcement Act 2007) <br><br> · Risk assessments and H&amp;S <br><br> This whole process forms part of your initial training and is paid for by the company. <br><br><strong>Would it suit you?</strong><br><br> The majority of enforcement agent roles will be front line and obtaining successful outcome to a legal court order. This in the main, will be debt based. The most common types of court order are: <br><br> · Criminal fines that defendants have not paid <br><br> · Arrest warrant for fines that defendants have failed to pay/appear in court <br><br> · Liability orders for Council tax debts <br><br> · Liability orders for Business rates where companies have defaulted on payments <br><br> · Traffic management fines that are due to Local Authorities <br><br> All of these types of roles in the field are debt based. Companies would therefore look for the following basic skill sets as being required initially: <br><br> · A confident but calm disposition <br><br> · Ability to negotiate and be a clear and concise communicator <br><br> · Be able to use standard tablet technology <br><br> · Remain calm under pressure <br><br> · Excellent work ethic <br><br> · Ability to work on your own or as part of a team. <br><br> · Well organised and self disciplined <br><br> Companies would also look for these backgrounds as desirable: <br><br> · Ex-military, a soldier or a role in the British Army for the Ministry of Defence or any ex-forces position <br><br> · Current Military but transitioning. e.g. security or close protection, warrant officer <br><br> · Sales background <br><br> · Door step work, collections, field or other <br><br> · Police <br><br> · Prison or Border Force e.g. immigration <br><br> · Security <br><br><strong>The role details:</strong><br><br> You will be working in the field. This means travel within an hour of your home base. You will be dealing with the persons named on the court order, identifying them and helping them solve the issue of the warrant or order. This can be difficult, and some are persistent offenders are apt at non-compliance. <br><br> Less than 1% of warrants and orders actually result in goods being taken into control. <br><br><strong>Role assistance</strong><br><br> The company from which you contract yourself to, will provide you with all the necessary tools. Handheld tablet device, discreet body worn video camera badge and of course all of the necessary skill sets and knowledge you need such as your legal rights. <br><br><strong>Self-employed and PAYE</strong><br><br> Most enforcement agent roles are self-employed, on a commission-based basis, but not all. The self-employed roles suit those who require flexibility in managing their time and are happy to be responsible for their own time and records management and the ability to work across multiple work roles. <br><br> Richardson Bailey provide a fully qualified accountant who will set up any HMRC initial work regarding tax codes and record keeping as a free, up-front service. <br><br> With self-employment comes the requirement to be results driven, being able to manage your time and plan accordingly and be dedicated to the role. It’s not for everyone. <br><br><strong>Making the right career decision for you</strong><br><br> Richardson Bailey specialises and works solely in the judicial services and enforcement workspace. <br><br> Judicial service is not for everyone. We provide e-learning awareness, mentoring, industry contacts, and a personalised and bespoke service to a prospective candidate. We provide an up-front, honest and open and clear understanding of the sector for you. <br><br> We are not a purveyor or processor of CV’s and every candidate will be contacted personally at each point of the process. <br><br> Not all work is equal. <br> Your performance and your earnings will be based on many factors, not least the location’s you work in and the volume your company issue to you as a contractor. Some work will undoubtedly be better quality than others. <br><br> Contracts from government departments can move between companies and so commission structures can change. <br><br> Richardson Bailey have industry and sector knowledge that will help you be placed in the right role for you. <br><br> Only when you are fully conversant with that will we consider recommending and placing you with a company, throughout your journey you will be personally managed by industry experts. <br><br> We will not just pass a CV over until we are 100% sure the role is the correct one for you.</div>"], "Date_Posted": "2018-07-10", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:31:00 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/php-developer-icontract-uk-JV_IC2671300_KO0,13_KE14,26.htm?jl=2842515448", "Job_Id": "2842515448", "Employment_Type": "", "Location": "London", "Region": "", "Salary": "", "Posted_By": " iContract (UK)", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-iContract-UK-EI_IE2167003.11,23.htm", "Job_Title": "PHP Developer", "Country": "London,", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"><p>Contract PHP Developer</p><p>What’s needed for me to be considered?</p><p>Strong experience with PHP Experience working with MySQL databases Experience with JavaScript including jQuery Experience using Docker is highly desirable Experience using GIT Experience with automated/unit testing and continuous integration environments (Jenkins) Be familiar with linux</p><p>Key skills: PHP, Linux, LAMP, JavaScript<br><br>Find out more and apply here &gt;&gt; https://bit.ly/2m5out2 </p></div>"], "Date_Posted": "2018-07-10", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:31:09 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/group-leader-autoimmune-immunocore-JV_IC3380454_KO0,23_KE24,34.htm?jl=2827950708", "Job_Id": "2827950708", "Employment_Type": "", "Location": "Oxford", "Region": "", "Salary": "", "Posted_By": " Immunocore", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-Immunocore-EI_IE1202060.11,21.htm", "Job_Title": "Group Leader, Autoimmune", "Country": "Oxford,", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"><strong>We are seeking an experienced CELL BIOLOGIST to join our vibrant, fast-moving and multi-disciplinary team!</strong><br><br><strong>Salary:</strong><strong>£50,000-£65,000 per annum</strong><br><br> Responsibilities include: <ul><li>Lead the Cell Biology efforts to characterize our effector molecules and ImmTAAI drug candidates in cellular models relevant to Autoimmunity</li><li>Contribute significantly to the overall strategy of the Autoimmune Department and represent the team in front of internal and external partners</li><li>Lead a high performance team of cellular immunologists (8 FTEs) and generate a cell-based assay platform to advance our molecules towards development</li></ul> To succeed in this role, you should have a strong background in autoimmune research. Experience in translational biology or Treg immunology would be a distinct advantage. <br><br> As part of the autoimmune leadership team you should be a strategist and skilled problem-solver who can define project-relevant questions, design experiments to address these and interpret findings in a larger context. You will be an excellent communicator and strong team player, with the ability to network in a multi-disciplinary environment. You will have the ability to see your contributions in a broader context and support your team members in their career development. <br><br> A strong background in autoimmune diseases together with an advanced scientific degree - PhD in cell biology or a related discipline - and extensive postdoctoral experience, preferably in industry, are a requirement. The candidate should also have previous line management experience and the ability to lead a highly talented team in a fast-paced environment. <br><br> We look forward to hearing from you!</div>"], "Date_Posted": "2018-06-27", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:31:20 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/inside-sales-consultant-topdesk-JV_KO0,23_KE24,31.htm?jl=2830474094", "Job_Id": "2830474094", "Employment_Type": "", "Location": "Greater", "Region": "", "Salary": "", "Posted_By": " TOPdesk", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-TOPdesk-EI_IE593680.11,18.htm", "Job_Title": "Inside Sales Consultant", "Country": "Greater", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"> Inside Sales Consultant<br><br>As an inside sales consultant, you work independently on your own sales projects and convert leads, handed to you through marketing and Lead Generation acquisition, to onsite meetings. You deal with multiple customers and guide them through the sales process. You advise customers how to improve their service processes with our software. You are surrounded by enthusiastic colleagues and are part of a winning IT service management team. You will have the opportunity to explore and build your responsibilities quickly within the work field of a small office. <br><br> We are looking for enthusiastic, commercially minded <br> employees to help us achieve success<br><br>Training period<br><br>You will have the opportunity to become an expert in providing information and advice on our products and services. At TOPdesk, we believe in learning on the job. As such, you can expect to join our Account Managers in potential customer demonstrations within your first few weeks here. <br><br> During your first few months, you will follow a specialized training plan for inside sales consultants in our HQ in Delft, the Netherlands; this training will be implemented over 2-4 weeks. In the Netherlands, you will be assigned a personal coach who will guide you through your training process. <br><br> The training in both the Netherlands and the UK will focus on product knowledge, sales skills and customer focus on the phone. After your initial training period, you can expect to enjoy a large degree of independence to take responsibility in an informal working environment where personal and professional growth is central. Once you have gained experience, you will have the opportunity for career growth in the Account Management or Software Consultancy fields.<br><br>TOPdesk Ltd<br><br>TOPdesk Ltd is the UK branch of the Dutch software company TOPdesk, a leading Service Management supplier with offices in the Netherlands, Belgium, Germany, Hungary, Denmark and the United Kingdom. TOPdesk develops, implements and supports software that helps organizations to efficiently organize their service desk and service processes. <br><br> The London office supports our local clients and is responsible for software sales, consultancy and client satisfaction. The office is growing rapidly and we want you to grow with us. TOPdesk offers extensive training and a strong platform for you to develop both personally and professionally in a friendly and social environment. We are looking for flexible, versatile people to take advantage of this exciting opportunity. <br><br> TOPdesk people are energetic and innovative, helping our clients to develop and achieve their business goals. We thrive on the responsibility and freedom that TOPdesk cultivates. As a global service management provider, our work creates a positive difference to our clients in both public and private organizations, with the likes of Honda, Baker and McKenzie, McDonalds, IKEA and the University of Edinburgh. TOPdesk solutions are being implemented worldwide for small and large organizations alike. <br><br> If you are self-motivated with the confidence to develop and implement your own ideas, be responsible for creating your own working environment and enjoy IT-focused sales, TOPdesk would provide an ideal chance to build your career at a young, dynamic software company. TOPdesk is currently market leader in Belgium, the Netherlands and Luxembourg. You will fulfil an important part in achieving the same results in the UK market.<br><br>Our ideal candidate <ul><li>A minimum 2:1 in their University degree and/or master’s degree</li><li>Customer orientated and commercially minded</li><li>Pragmatic and inquisitive</li><li>Enjoys working in an international and multicultural environment</li><li>Great analytical skills</li></ul> What can you expect from us?<br><br>A great opportunity for personal and professional development <br> The freedom to innovate and manage your tasks independently <br> Consultative selling with a lot of direct client contact across a spectrum of industries <br> A cooperative working environment<br><br>Apply now<br><div></div><br></div>"], "Date_Posted": "2018-06-29", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:31:27 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/senior-communications-manager-george-buckland-JV_IC2671300_KO0,29_KE30,45.htm?jl=2842422114", "Job_Id": "2842422114", "Employment_Type": "", "Location": "London", "Region": "", "Salary": "", "Posted_By": " George Buckland Limited", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-George-Buckland-EI_IE1319794.11,26.htm", "Job_Title": "Senior Communications Manager", "Country": "London,", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"><strong>Manage a portfolio of high value clients. Pensions &amp; Employee Benefits Consultancy.</strong><br><br> My client is a leading Pensions and Employee Benefits Consultancy with 200+ top tier clients. <br><br> As Senior Communications Manager you will : <ul><li>Account Manage a high value client portfolio consisting of substantial, well established accounts</li><li>Consult with your clients on creative and effective Pensions and Employee Benefits Communications</li><li>Develop a strategic knowledge of your client's business</li><li>Own your clients annual Communications Plan</li><li>Identify new business opportunities within your client portfolio</li><li>Maximise account growth within agreed revenue targets</li><li>Lead on briefing Project and Creative Teams.</li><li>Monitor the progress of campaign delivery against revenue forecasts</li><li>Line Manage a junior communications consultant</li></ul><strong>Experience and Competency required :</strong><ul><li>A good understanding of Pensions and Employee Benefits</li><li>Relationship Builder - ability to engage with a wide range of clients and interpret their needs into creative communication briefs and revenue generating solutions</li><li>Confident Presenter - you'll enjoy delivering formal client presentations and engaging clients</li><li>Commercially focussed - ability to control detailed forecasting and critically monitor progress</li></ul> This ia an opportunity to join a blue-chip pensions and benefits consultancy and work with a top-tier client base <br><br> Located in the heart of the City you'll benefit from a terrific team environment and excellent career development. <br><br> This is an immediately available position and therefore do not delay in applying.</div>"], "Date_Posted": "2018-07-10", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:31:33 2018", "Data_Source": "glassdoor.co.uk"},
{"Job_Url": "https://www.glassdoor.co.uk/job-listing/technical-account-manager-spigit-JV_IC2671300_KO0,25_KE26,32.htm?jl=2829507003", "Job_Id": "2829507003", "Employment_Type": "", "Location": "London", "Region": "", "Salary": "", "Posted_By": " Spigit", "Job_Poster_Url": "https://glassdoor.co.uk/Overview/Working-at-Spigit-EI_IE358005.11,17.htm", "Job_Title": "Technical Account Manager", "Country": "London,", "Job_Description": ["<div class=\"jobDescriptionContent desc module pad noMargBot\"><strong>About Spigit</strong><br><br> Spigit is the world's number one innovation management software platform used by Fortune 500 and Enterprise companies globally to drive innovation and growth at scale. Companies such as AT&amp;T, Citi Bank, IBM, Siemens, UNHCR and United Health Care are using Spigit to help drive their Innovation Programs and Strategy. <br><br><strong>Learn more about Spigit at</strong> www.spigit.com <br><br> We are currently looking for an Innovation Technical Account Manager to join our experienced London (Chiswick) based team to help support our growing EMEA business and support the successful on-boarding, design and Spigit SaaS software management of innovation projects. <br><br><strong>About the Role</strong><br><br> If youre an entrepreneurial problem solver interested in playing an integral role helping a thriving software company with a rapidly growing market share in EMEA, then this opportunity may interest you. The Innovation Technical Account Manager role at Spigit sits at the intersection of business and technology. It requires an even mix of technical project management and SaaS (Software as a Service) software platform management. <br><br> You will be working directly with technical counterparts at Spigits customers, managing expectations, executing on projects, providing excellent service and building strong relationships. <br><br> The Innovation Technical Account Manager coordinates various project activities required to onboard customers and their use of Spigit for a successful innovation project launch and lifecycle, including: <br><br> Configure Spigit SaaS software based on customer use cases. <br><br> Coordinate the client on-boarding process from discovery through to launch. <br><br> Delivering community-building best-practice consultation and training to customer teams. <br><br> Provide ongoing support and consultation throughout the customer engagement. <br><br> Working closely across both the Services &amp; Sales team. <br><br> The Innovation Technical Account Manager works with an Customer Success/Innovation Director to coordinate innovation project based activities across a number of stakeholder groups with significant executive sponsorship and visibility. Scope of these programs varies from local to a global in nature, and incorporates a mix of needs: <br><br> Innovation Management <br><br> Idea/Innovation Crowdsourcing <br><br> Community Management <br><br> Organisational Change Management <br><br> Social Collaborative Technologies <br><br> You will be supported by an incredible international team (headquartered in San Francisco, with offices in London &amp; Sydney) that is smart, caring, and nimble. We are a group of individuals committed to providing our customers with world-class technology, best-in-class strategic services. <br><br><strong>Role Responsibilities</strong><br><br> The role will be responsible for managing the internal and external resources needed to deliver technical innovation projects. Work is performed primarily through desktop sharing and web conferencing and some face-face customer interaction, with local and international travel expected. <br><br><strong>Role responsibilities include but not limited to:</strong><br><br> Serve as the primary technical contact for our customers, and ensure the satisfactory resolution of all support requests by interfacing with Product and Engineering teams. <br><br> Project manage and guide the implementation process, from project kickoff through to launch. Scope, plan and manage progress against the plan - set up weekly meetings, and manage deliverables/milestones, escalate risks and issues, propose solutions. <br><br> Manage multiple technical projects concurrently providing excellent service and building a strong long-term partnership with clients. <br><br> Train Customers on all technical and non-technical aspects of Spigits SaaS software. <br><br> Track, report, and communicate customer progress, risks, issues to customer and management as required. <br><br> Chair working group sessions to ensure effective community architecture and governance, plan execution and reporting. <br><br> Engage relevant Spigit technical expertise for branding design of community, integration of components (e.g. Single Sign-On, SharePoint), and issue resolution. <br><br> Collaborate with the customers stakeholders, Spigit team members to understand and document requirements, success criteria, priorities, expectations and commitments. <br><br> Guide customers build deep knowledge and a sustainable practices for leveraging the collective intelligence of their employee, customer, and/or citizen-based Spigit communities. <br><br><strong>Essential Experience:</strong><br><br> A Bachelors degree and at least 3-5 years of work experience preferably in a technical and/or customer facing role. <br><br> High level of comfort with training and supporting clients on a technology platform. Experience with configuring and implementing software applications. <br><br> Project management skills: specifically, being able to lay out deliverables and follow-through on executing them. <br><br> Strong stakeholder management, presentation and communication skills, including preparation of senior management briefing materials. <br><br> Consultative services experience working client-side or supply-side. <br><br> Implementing major initiatives within private or public institutions. <br><br><strong>Supplementary Experience:</strong><br><br> Knowledge of the delivery of SaaS, infrastructure products and services. <br><br> Basic knowledge or prior experience of web development and troubleshooting with HTML and CSS is a plus. <br><br> Knowledge of innovation methodologies such as but not limited to Design Thinking, Human Centred Design. <br><br> Experience and aptitude for innovation related technologies and SaaS platforms is a plus. <br><br><strong>PLEASE EMAIL YOUR RESUME TO</strong>: <strong>spigit.TAM@applynow.io</strong><br><br> Spigit, Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, marital or registered domestic partnership status, national origin, ancestry, age, medical condition, physical or mental disability, genetic information, military or veteran status, or any other characteristic protected by applicable federal, state or local law.</div>"], "Date_Posted": "2018-06-28", "Valid_Till": "", "Industry": "", "Time_Crawled": "Thu Jul 12 11:31:40 2018", "Data_Source": "glassdoor.co.uk"}
]